
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 3 to change, 12 to destroy.</code></pre>

* Create
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server.pgsql_server
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_database.pg_databases[&#34;idamtstsptapi&#34;]
  * module.idam-testing-support-api-db-v14.azurerm_resource_group.rg[0]
  * module.idam-testing-support-api-db-v14.null_resource.set-user-permissions-additionaldbs[&#34;idamtstsptapi&#34;]
  * module.idam-testing-support-api-db-v14.random_password.password
* Update
  * azurerm_key_vault_secret.POSTGRES-PASS[0]
  * azurerm_key_vault_secret.POSTGRES-USER[0]
  * azurerm_key_vault_secret.POSTGRES_HOST[0]
* Delete
  * module.idam-testing-support-api-db[0].azurerm_postgresql_active_directory_administrator.admin
  * module.idam-testing-support-api-db[0].azurerm_resource_group.data-resourcegroup
  * module.idam-testing-support-api-db[0].azurerm_template_deployment.postgres-paas
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[0]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[1]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[2]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[3]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[4]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[5]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[6]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[7]
  * module.idam-testing-support-api-db[0].random_string.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + content_type            = ""
        id                      = "https://idam-idam-aat.vault.azure.net/secrets/idam-testing-support-api-POSTGRES-PASS/f34b0faebf164649bd7600d285087a91"
        name                    = "idam-testing-support-api-POSTGRES-PASS"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
        id                      = "https://idam-idam-aat.vault.azure.net/secrets/idam-testing-support-api-POSTGRES-USER/f700b92654d04b2da9788f628095b5d8"
        name                    = "idam-testing-support-api-POSTGRES-USER"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://idam-idam-aat.vault.azure.net/secrets/idam-testing-support-api-POSTGRES-HOST/4fbb4abb001042cd9895768c15348f89"
        name                    = "idam-testing-support-api-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.idam-testing-support-api-db[0].azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because azurerm_postgresql_active_directory_administrator.admin is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-testing-support-api-data-idam-aat/providers/Microsoft.DBforPostgreSQL/servers/idam-testing-support-api-idam-aat" -> null
      - login               = "DTS Platform Operations" -> null
      - object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - resource_group_name = "idam-testing-support-api-data-idam-aat" -> null
      - server_name         = "idam-testing-support-api-idam-aat" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.idam-testing-support-api-db[0].azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-testing-support-api-data-idam-aat" -> null
      - location = "uksouth" -> null
      - name     = "idam-testing-support-api-data-idam-aat" -> null
      - tags     = {
          - "application"         = "cft-idam"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/idam-testing-support-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#idam-support-cft"
          - "environment"         = "staging"
          - "managedBy"           = "IdAM"
        } -> null
    }

  # module.idam-testing-support-api-db[0].azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-testing-support-api-data-idam-aat/providers/Microsoft.Resources/deployments/idam-testing-support-api-idam-aat" -> null
      - name                = "idam-testing-support-api-idam-aat" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "idamtstsptapi"
          - "administratorLoginPassword" = "mQe:%ZlphrDUKWo#"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImNmdC1pZGFtIiwiYXV0b1NodXRkb3duIjoidHJ1ZSIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9pZGFtLXRlc3Rpbmctc3VwcG9ydC1hcGkuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNpZGFtLXN1cHBvcnQtY2Z0IiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiSWRBTSJ9"
          - "dbName"                     = "idamtstsptapi"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiaWRhbUp1bXBCb3giLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYzRmMDcwNC1hMjllLTQwM2QtYjcxOS1iOTBjMzRlZjE0YzkvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1pZGFtLWFhdC9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdC9zdWJuZXRzL2NvcmUtaW5mcmEtc3VibmV0LTE1LWlkYW0tYWF0In0seyJydWxlX25hbWUiOiJhc2UiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYzRmMDcwNC1hMjllLTQwM2QtYjcxOS1iOTBjMzRlZjE0YzkvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1pZGFtLWFhdC9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdC9zdWJuZXRzL2NvcmUtaW5mcmEtc3VibmV0LTItaWRhbS1hYXQifSx7InJ1bGVfbmFtZSI6ImFrcy1wcmV2aWV3LTAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWM0ZjA3MDQtYTI5ZS00MDNkLWI3MTktYjkwYzM0ZWYxNGM5L3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtcHJldmlldy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1wcmV2aWV3L3N1Ym5ldHMvYWtzLXN1Ym5ldCJ9LHsicnVsZV9uYW1lIjoiYWtzLWFhdC0wMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzk2YzI3NGNlLTg0NmQtNGU0OC04OWE3LWQ1Mjg0MzIyOThhNy9yZXNvdXJjZUdyb3Vwcy9jZnQtYWF0LW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtYWF0LXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6ImFrcy1hYXQtMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy85NmMyNzRjZS04NDZkLTRlNDgtODlhNy1kNTI4NDMyMjk4YTcvcmVzb3VyY2VHcm91cHMvY2Z0LWFhdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LWFhdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJqdW1wYm94LWlkYW0tYWF0MiIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC0xNS1pZGFtLWFhdDIifSx7InJ1bGVfbmFtZSI6ImplbmtpbnMtYWtzIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWJhZjU0NzAtMWMzZS00MGQzLWE2ZjctNzRiZmJjZTRiMzQ4L3Jlc291cmNlR3JvdXBzL2NmdC1wdGwtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1wdGwtdm5ldC9zdWJuZXRzL2lhYXMifSx7InJ1bGVfbmFtZSI6ImplbmtpbnMtYWtzLWFnZW50Iiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWJhZjU0NzAtMWMzZS00MGQzLWE2ZjctNzRiZmJjZTRiMzQ4L3Jlc291cmNlR3JvdXBzL2NmdC1wdGwtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1wdGwtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9XQ=="
          - "env"                        = "idam-aat"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "idam-testing-support-api-idam-aat"
          - "skuCapacity"                = "4"
          - "skuName"                    = "GP_Gen5_4"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "idam-testing-support-api-data-idam-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "7100044811160686503" -> null
      - triggers = {
          - "rule_name" = "idamJumpBox"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat/subnets/core-infra-subnet-15-idam-aat"
        } -> null
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5541893339417040432" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat/subnets/core-infra-subnet-2-idam-aat"
        } -> null
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3753791363156794653" -> null
      - triggers = {
          - "rule_name" = "aks-preview-00"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-preview/subnets/aks-subnet"
        } -> null
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6947341045870012316" -> null
      - triggers = {
          - "rule_name" = "aks-aat-00"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
        } -> null
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8906036616404128368" -> null
      - triggers = {
          - "rule_name" = "aks-aat-01"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
        } -> null
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5022338302703289333" -> null
      - triggers = {
          - "rule_name" = "jumpbox-idam-aat2"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-15-idam-aat2"
        } -> null
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3867525544407561519" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2285164418197390873" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.idam-testing-support-api-db[0].random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "mQe:%ZlphrDUKWo#" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "mQe:%ZlphrDUKWo#" -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "idam-idam-aat-v14-testing-support-api-idam-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "idam-idam-aat-v14-testing-support-api-data-idam-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "cft-idam"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/idam-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#idam-support-cft"
          + "environment"         = "staging"
          + "expiresAfter"        = "3000-12-31"
          + "managedBy"           = "IdAM"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "idam-idam-aat-v14-testing-support-api-data-idam-aat"
      + server_name         = "idam-idam-aat-v14-testing-support-api-idam-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "idam-idam-aat-v14-testing-support-api-data-idam-aat"
      + server_name         = "idam-idam-aat-v14-testing-support-api-idam-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_database.pg_databases["idamtstsptapi"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "idamtstsptapi"
      + server_id = (known after apply)
    }

  # module.idam-testing-support-api-db-v14.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "idam-idam-aat-v14-testing-support-api-data-idam-aat"
      + tags     = {
          + "application"         = "cft-idam"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/idam-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#idam-support-cft"
          + "environment"         = "staging"
          + "expiresAfter"        = "3000-12-31"
          + "managedBy"           = "IdAM"
        }
    }

  # module.idam-testing-support-api-db-v14.null_resource.set-user-permissions-additionaldbs["idamtstsptapi"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "idam-idam-aat-v14-testing-support-api"
          + "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        }
    }

  # module.idam-testing-support-api-db-v14.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 8 to add, 3 to change, 12 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":335,"Program":"tfcmt","SHA1":"","Vars":{}} -->